<template>
  <div>
    <DgaHead>{{ $t("cookiePolicy.title") }}</DgaHead>
    <p class="my-4 text-md indent-8">
      เมื่อท่านได้เข้าสู่ระบบการลงคะแนนเสียงทางอิเล็กทรอนิกส์โดยใช้บล็อกเชน (Blockchain-based e-Voting) ข้อมูลที่เกี่ยวข้องกับการเข้าสู่ระบบของท่านจะถูกบันทึกไว้ในรูปแบบของคุ้กกี้ โดยนโยบายคุกกี้นี้จะอธิบายถึงความหมาย การทำงาน วัตถุประสงค์ รวมถึงการลบ และการปฏิเสธการเก็บคุกกี้ เพื่อความเป็นส่วนตัวของท่านโดยการเข้าสู่ระบบนี้ ถือว่าท่านได้อนุญาตให้ สพร. ใช้คุกกี้ตามนโยบายคุกกี้ที่มีรายละเอียดดังต่อไปนี้
    </p>
    <ol class="font-bold list-decimal ml-4">
      <li>คุกกี้คืออะไร</li>
    </ol>
    <p class="my-4 text-md indent-8">
      คุกกี้ (Cookie) คือ ไฟล์ข้อความขนาดเล็กที่ถูกดาวน์โหลดไปยังอุปกรณ์คอมพิวเตอร์หรืออุปกรณ์
      มือถือของท่าน ซึ่งทำหน้าที่บันทึกข้อมูลและการตั้งค่าต่าง ๆ เช่น บันทึกข้อมูลการตั้งค่าภาษาในอุปกรณ์ของท่าน บันทึกสถานะการเข้าใช้งานในปัจจุบันของท่าน เพื่อช่วยให้ท่านสามารถเข้าใช้งานเว็บไซต์และ/หรือแอปพลิเคชัน (รวมเรียกว่า “บริการ”) ได้อย่างต่อเนื่อง รวมถึงมีการรวบรวมข้อมูลเกี่ยวกับประวัติการเข้าใช้งานบริการในรูปแบบไฟล์ โดยคุกกี้ไม่ได้ทำให้เกิดอันตรายต่ออุปกรณ์ของท่าน และเนื้อหาในคุกกี้จะถูกเรียกออกมาดูหรืออ่านได้โดยบริการที่สร้างคุกกี้ดังกล่าวเท่านั้น
    </p>
    <ol class="font-bold list-decimal ml-4" start="2">
      <li>มีการใช้คุกกี้ในลักษณะใด</li>
    </ol>
    <p class="my-4 text-md indent-8">
      ระบบการลงคะแนนเสียงทางอิเล็กทรอนิกส์โดยใช้บล็อกเชน (Blockchain-based e-Voting) มีการจัดเก็บและใช้งานคุกกี้เพื่อรวบรวม จัดเก็บและส่งมอบประสบการณ์การใช้งานเชิงโต้ตอบที่หลากหลายให้กับผู้ใช้งาน ให้สอดคล้องตามวัตถุประสงค์ตามแอปพลิเคชันที่ให้บริการ
    </p>
    <ol class="font-bold list-decimal ml-4" start="3">
      <li>ประเภทของคุกกี้</li>
    </ol>
    <p class="my-4 text-md">
      แบ่งได้ 2 ประเภท ดังนี้
      <ul class="ml-4">
        <li class="my-2">
          <div class="font-bold my-2">คุกกี้ที่มีความจำเป็น</div>
          <ul class="list-disc ml-4">
            <li>เพื่อจัดเก็บการกำหนดลักษณะและการตั้งค่าบนอุปกรณ์</li>
            <li>การลงชื่อเข้าใช้งานและการรับรองความถูกต้อง</li>
            <li>เพื่อประมวลผลข้อมูลที่ช่วยในการรักษาความปลอดภัยผลิตภัณฑ์รวมทั้งตรวจจับการฉ้อโกงและการใช้งานในทางที่ผิด</li>
          </ul>
        </li>
        <li class="my-2">
          <div class="font-bold my-2">คุกกี้เพื่อการวิเคราะห์และประเมินผลการใช้งาน</div>
          <ul class="list-none">
            <li>
              ใช้เพื่อรวบรวมข้อมูลการใช้งานและประสิทธิภาพการทำงาน เช่น นับจำนวนของผู้เข้าชมเฉพาะที่เข้ามายังหน้าเว็บหรือบริการ เพื่อให้ทราบถึงพฤติกรรมของผู้ใช้งาน การปฏิสัมพันธ์ของผู้ใช้งานในการใช้บริการเว็บไซต์ของ สพร. เป็นต้น
            </li>
          </ul>
        </li>
      </ul>
    </p>
    <ol class="font-bold list-decimal ml-4" start="4">
      <li>ระบบการลงคะแนนเสียงทางอิเล็กทรอนิกส์โดยใช้บล็อกเชน (Blockchain-based e-Voting) ใช้คุกกี้อะไรบ้าง</li>
    </ol>
    <p class="my-4 text-md indent-8">
      เพื่อให้ท่านได้รับทราบข้อมูลการใช้งานคุกกี้ที่ถูกต้อง ท่านสามารถตรวจสอบการใช้งานคุกกี้ได้
      ผ่าน Application ที่ท่านใช้งานหรือสามารถตรวจสอบรายละเอียดการใช้งานคุกกี้ได้จากเว็บไซต์ของเจ้าของผลิตภัณฑ์ ทั้งนี้ คุกกี้ที่ สพร. ใช้ แบ่งได้ดังนี้
      <ul class="ml-4">
        <li class="my-2">
          <div class="font-bold my-2">คุกกี้ที่มีความจำเป็น</div>
          <ul class="list-disc ml-4">
            <li>คุกกี้ของเจ้าของผลิตภัณฑ์ที่เก็บข้อมูลรายละเอียดผู้ใช้งานหรือลักษณะบัญชีการใช้งาน: sid, i18n_redirected, cc</li>
          </ul>
        </li>
        <li class="my-2">
          <div class="font-bold my-2">คุกกี้เพื่อการวิเคราะห์และประเมินผลการใช้งาน</div>
          <ul class="list-disc ml-4">
            <li>ไม่มี</li>
          </ul>
        </li>
      </ul>
    </p>
    <ol class="font-bold list-decimal ml-4" start="5">
      <li>การปิดกั้นการใช้งานคุกกี้</li>
    </ol>
    <p class="my-4 text-md indent-8">
      ท่านสามารถหยุดการใช้งานคุกกี้บนอุปกรณ์ของท่านได้โดยการเปิดใช้งานการตั้งค่าบนเบราว์เซอร์ของท่านที่อนุญาตให้บล็อกการใช้งานคุกกี้ทั้งหมดหรือบางส่วน โดยท่านสามารถดูวิธีการได้ที่ www.allaboutcookies.org ในการนี้ หากท่านใช้การตั้งค่าเบราว์เซอร์ของท่านเพื่อบล็อกคุกกี้ ท่านอาจไม่สามารถเข้าถึงทั้งหมดหรือบางส่วนของระบบของเราได้ 
    </p>
    <ol class="font-bold list-decimal ml-4" start="6">
      <li>ติดต่อ สพร.</li>
    </ol>
    <p class="my-4 text-md">
      หากท่านมีคำถามเกี่ยวกับนโยบายนี้ โปรดติดต่อ สพร.โดยมีรายละเอียด ดังนี้
      <ul class="ml-4">
        <li class="my-2">
          <div class="font-bold my-2">เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล (Data Protection Officer: DPO)</div>
          <ul class="list-disc ml-4">
            <li>สถานที่ติดต่อ: เลขที่ 108 อาคารบางกอกไทยทาวเวอร์ ชั้น 17 ถนนรางน้ำ แขวงถนนพญาไท เขตราชเทวี กรุงเทพมหานคร</li>
            <li>ช่องทางการติดต่อ: DGA_pdpa@dga.or.th และ contact@dga.or.th</li>
            <li>โทรศัพท์ที่ 02-612-6000</li>
          </ul>
        </li>
      </ul>
    </p>
    <ol class="font-bold list-decimal ml-4" start="7">
      <li>การเปลี่ยนแปลงนโยบาย</li>
    </ol>
    <p class="my-4 text-md indent-8">
      นโยบายนี้อาจมีการปรับปรุงให้เหมาะสมและสอดคล้องกับสถานการณ์และตามการให้บริการจริง โดย สพร. จะมีการแจ้งนโยบายที่มีการปรับปรุงใหม่บนเว็บไซต์ workd.go.th (e-vote.dga.or.th) ดังนั้น สพร. ขอแนะนำให้ท่านตรวจสอบให้แน่ใจว่าท่านได้เข้าใจการเปลี่ยนแปลงตามข้อกำหนดดังกล่าว
    </p>
  </div>
</template>

<script setup lang="ts">
const i18n = useI18n()

definePageMeta({
  middleware: ["auth"]
})

useHead({
  title: `${i18n.t('appName', 'DGA E-Voting')} - ${i18n.t('cookiePolicy.title')}`
});

</script>